Revit 2017 API
TextNote.GetFormattedText Method
 Returns an object that contains text and associated formatting of this note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public FormattedText GetFormattedText()
Visual Basic
Public Function GetFormattedText As FormattedText
Visual C++
public:
FormattedText^ GetFormattedText()
Return Value
 The object that contains the text and associated formatting of of the text in this text note.
Remarks
 The returned object is not attached to the text note and modifying it will not modify the contents of the text note. After changes are made to the FormattedText, use SetFormattedText(FormattedText) apply those changes to the TextNote.
See Also
TextNote Class
Autodesk.Revit.DB Namespace